/* BizSimAI - French Localization */

/* Common */
"app.name" = "BizSimAI";
"common.login" = "Connexion";
"common.logout" = "Déconnexion";
"common.save" = "Enregistrer";
"common.cancel" = "Annuler";
"common.error" = "Erreur";
"common.loading" = "Chargement...";
"common.success" = "Succès";
"common.retry" = "Réessayer";
"common.submit" = "Soumettre";
"common.back" = "Retour";
"common.done" = "Terminé";
"common.delete" = "Supprimer";
"common.edit" = "Modifier";
"common.close" = "Fermer";

/* Authentication */
"auth.professor_login" = "Accès Professeur";
"auth.student_access" = "Accès Étudiant";
"auth.username" = "Nom d'utilisateur";
"auth.password" = "Mot de passe";
"auth.student_id" = "ID Étudiant";
"auth.full_name" = "Nom complet";
"auth.team_name" = "Nom de l'équipe";
"auth.register" = "S'inscrire et rejoindre";
"auth.sign_in_apple" = "Se connecter avec Apple";
"auth.sign_in_google" = "Se connecter avec Google";
"auth.session_expired" = "Session expirée. Veuillez vous reconnecter.";

/* Session */
"session.create" = "Créer une session";
"session.join" = "Rejoindre la session";
"session.code" = "Code de session";
"session.round" = "Tour %d sur %d";
"session.status_waiting" = "En attente des joueurs";
"session.status_active" = "En cours";
"session.status_completed" = "Terminée";
"session.end" = "Terminer la session";
"session.delete" = "Supprimer la session";

/* Decisions */
"decision.submit" = "Soumettre les décisions";
"decision.submitted" = "Décisions soumises";
"decision.over_budget" = "Dépassement de budget";
"decision.invalid" = "Décisions invalides";

/* Results */
"results.leaderboard" = "Classement";
"results.profit" = "Profit";
"results.revenue" = "Revenu";
"results.market_share" = "Part de marché";
"results.stock_price" = "Cours de l'action";
"results.cumulative" = "Cumulé";

/* Sync */
"sync.online" = "En ligne";
"sync.offline" = "Hors ligne";
"sync.syncing" = "Synchronisation...";
"sync.error" = "Échec de la synchronisation";
"sync.saved_locally" = "Enregistré localement";

/* Professor */
"prof.dashboard" = "Tableau de bord";
"prof.sessions" = "Sessions";
"prof.analytics" = "Analytique";
"prof.announcements" = "Annonces";
"prof.grade_mapping" = "Correspondance des notes";

/* Student */
"student.team_dashboard" = "Tableau de bord de l'équipe";
"student.ai_coach" = "Coach IA";
"student.performance" = "Performance";

/* Navigation */
"nav.home" = "Accueil";
"nav.settings" = "Réglages";
"nav.profile" = "Profil";
"nav.help" = "Aide";

/* Errors */
"error.network" = "Erreur réseau. Veuillez vérifier votre connexion.";
"error.server" = "Erreur serveur. Veuillez réessayer plus tard.";
"error.unauthorized" = "Non autorisé. Veuillez vous reconnecter.";
"error.not_found" = "Ressource introuvable.";
